/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   find.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: akilk <akilk@student.hive.fi>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/07/10 20:59:49 by akilk             #+#    #+#             */
/*   Updated: 2022/07/10 21:03:41 by akilk            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// оценивать каждую возможность укладки детали по ее расстоянию до зоны противника
// чем ближе тем больше очков
